sdaiGetAggrElementBoundByItr(Sdai_ItrId*)
\details
Retrieves the aggregate element bound from a specified iterator.
\param iterator [in] An iterator to get the element bound from.
\returns An SDAI integer value that represents the element bound.